<?xml version="1.0" ?>
<net name="ICV-RMNet-PD-ReID-Light" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,96,48"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="143/Output_0/Data_/copy_const306_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,3,1,1" size="12"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/norm/scale/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="144/Output_0/Data_/copy_const308_const" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="1,3,1,1" size="12"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/norm/scale/Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="11171121_const" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="11181122_const" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="11191123_const" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="11201124_const" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="init_block1/dim_inc/conv/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="211/Output_0/Data__const310_const" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="32,3,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="11271131_const" type="Const" version="opset1">
			<data element_type="f32" offset="3488" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="11281132_const" type="Const" version="opset1">
			<data element_type="f32" offset="3616" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="11291133_const" type="Const" version="opset1">
			<data element_type="f32" offset="3744" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="11301134_const" type="Const" version="opset1">
			<data element_type="f32" offset="3872" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="init_block1/dim_inc/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="init_block1/dim_inc/conv/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="init_block1/dim_inc/conv/Dims2227/copy_const312_const" type="Const" version="opset1">
			<data element_type="f32" offset="4000" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="init_block1/dim_inc/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="init_block1/dim_inc/fn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="10571061_const" type="Const" version="opset1">
			<data element_type="f32" offset="4128" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="10581062_const" type="Const" version="opset1">
			<data element_type="f32" offset="4132" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="10591063_const" type="Const" version="opset1">
			<data element_type="f32" offset="4128" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="10601064_const" type="Const" version="opset1">
			<data element_type="f32" offset="4132" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="bottleneck1_1/add/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="183/Output_0/Data__const315_const" type="Const" version="opset1">
			<data element_type="f32" offset="4136" shape="8,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="15071511_const" type="Const" version="opset1">
			<data element_type="f32" offset="5160" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="15081512_const" type="Const" version="opset1">
			<data element_type="f32" offset="5192" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="15091513_const" type="Const" version="opset1">
			<data element_type="f32" offset="5160" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="15101514_const" type="Const" version="opset1">
			<data element_type="f32" offset="5192" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="bottleneck1_1/dim_red/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="bottleneck1_1/dim_red/conv/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="bottleneck1_1/dim_red/conv/Dims2149/copy_const317_const" type="Const" version="opset1">
			<data element_type="f32" offset="5224" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="bottleneck1_1/dim_red/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="bottleneck1_1/dim_red/fn" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="14571461_const" type="Const" version="opset1">
			<data element_type="f32" offset="5256" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="14581462_const" type="Const" version="opset1">
			<data element_type="f32" offset="5288" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="14591463_const" type="Const" version="opset1">
			<data element_type="f32" offset="5256" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="14601464_const" type="Const" version="opset1">
			<data element_type="f32" offset="5288" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="bottleneck1_1/inner/dw1/conv/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="652578_const" type="Const" version="opset1">
			<data element_type="f32" offset="5320" shape="8,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="14671471_const" type="Const" version="opset1">
			<data element_type="f32" offset="5608" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="14681472_const" type="Const" version="opset1">
			<data element_type="f32" offset="5640" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="14691473_const" type="Const" version="opset1">
			<data element_type="f32" offset="5608" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="14701474_const" type="Const" version="opset1">
			<data element_type="f32" offset="5640" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="bottleneck1_1/inner/dw1/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="3990/value3992_const" type="Const" version="opset1">
			<data element_type="i64" offset="5672" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="3990" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bottleneck1_1/inner/dw1/conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="bottleneck1_1/inner/dw1/conv/Dims2035/copy_const322_const" type="Const" version="opset1">
			<data element_type="f32" offset="5712" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="bottleneck1_1/inner/dw1/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="bottleneck1_1/inner/dw1/fn" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="20772081_const" type="Const" version="opset1">
			<data element_type="f32" offset="5744" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="20782082_const" type="Const" version="opset1">
			<data element_type="f32" offset="5748" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="20792083_const" type="Const" version="opset1">
			<data element_type="f32" offset="5744" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="20802084_const" type="Const" version="opset1">
			<data element_type="f32" offset="5748" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="bottleneck1_1/dim_inc/conv/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="185/Output_0/Data__const325_const" type="Const" version="opset1">
			<data element_type="f32" offset="5752" shape="32,8,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="20872091_const" type="Const" version="opset1">
			<data element_type="f32" offset="6776" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="20882092_const" type="Const" version="opset1">
			<data element_type="f32" offset="6904" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="20892093_const" type="Const" version="opset1">
			<data element_type="f32" offset="6776" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="20902094_const" type="Const" version="opset1">
			<data element_type="f32" offset="6904" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="bottleneck1_1/dim_inc/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="bottleneck1_1/dim_inc/conv/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="bottleneck1_1/dim_inc/conv/Dims2155/copy_const327_const" type="Const" version="opset1">
			<data element_type="f32" offset="7032" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="bottleneck1_1/dim_inc/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="10671071_const" type="Const" version="opset1">
			<data element_type="f32" offset="7160" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="10681072_const" type="Const" version="opset1">
			<data element_type="f32" offset="7164" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="10691073_const" type="Const" version="opset1">
			<data element_type="f32" offset="7160" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="10701074_const" type="Const" version="opset1">
			<data element_type="f32" offset="7164" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="bottleneck1_1/add/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bottleneck1_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="bottleneck1_1/fn" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="937941_const" type="Const" version="opset1">
			<data element_type="f32" offset="7168" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="938942_const" type="Const" version="opset1">
			<data element_type="f32" offset="7172" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="939943_const" type="Const" version="opset1">
			<data element_type="f32" offset="7168" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="940944_const" type="Const" version="opset1">
			<data element_type="f32" offset="7172" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="bottleneck1_2/add/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="129/Output_0/Data__const331_const" type="Const" version="opset1">
			<data element_type="f32" offset="7176" shape="8,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="15471551_const" type="Const" version="opset1">
			<data element_type="f32" offset="8200" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="15481552_const" type="Const" version="opset1">
			<data element_type="f32" offset="8232" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="15491553_const" type="Const" version="opset1">
			<data element_type="f32" offset="8200" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="15501554_const" type="Const" version="opset1">
			<data element_type="f32" offset="8232" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="bottleneck1_2/dim_red/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="bottleneck1_2/dim_red/conv/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bottleneck1_2/dim_red/conv/Dims2245/copy_const333_const" type="Const" version="opset1">
			<data element_type="f32" offset="8264" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bottleneck1_2/dim_red/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="bottleneck1_2/dim_red/fn" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="11371141_const" type="Const" version="opset1">
			<data element_type="f32" offset="8296" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="11381142_const" type="Const" version="opset1">
			<data element_type="f32" offset="8328" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="11391143_const" type="Const" version="opset1">
			<data element_type="f32" offset="8296" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="11401144_const" type="Const" version="opset1">
			<data element_type="f32" offset="8328" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="bottleneck1_2/inner/dw1/conv/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="656580_const" type="Const" version="opset1">
			<data element_type="f32" offset="8360" shape="8,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="11471151_const" type="Const" version="opset1">
			<data element_type="f32" offset="8648" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="11481152_const" type="Const" version="opset1">
			<data element_type="f32" offset="8680" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="11491153_const" type="Const" version="opset1">
			<data element_type="f32" offset="8648" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="11501154_const" type="Const" version="opset1">
			<data element_type="f32" offset="8680" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="bottleneck1_2/inner/dw1/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="4018/value4020_const" type="Const" version="opset1">
			<data element_type="i64" offset="5672" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="4018" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="bottleneck1_2/inner/dw1/conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="bottleneck1_2/inner/dw1/conv/Dims2101/copy_const338_const" type="Const" version="opset1">
			<data element_type="f32" offset="8712" shape="1,8,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="bottleneck1_2/inner/dw1/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="bottleneck1_2/inner/dw1/fn" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="957961_const" type="Const" version="opset1">
			<data element_type="f32" offset="8744" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="958962_const" type="Const" version="opset1">
			<data element_type="f32" offset="8748" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="959963_const" type="Const" version="opset1">
			<data element_type="f32" offset="8744" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="960964_const" type="Const" version="opset1">
			<data element_type="f32" offset="8748" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="bottleneck1_2/dim_inc/conv/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="193/Output_0/Data__const341_const" type="Const" version="opset1">
			<data element_type="f32" offset="8752" shape="32,8,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="967971_const" type="Const" version="opset1">
			<data element_type="f32" offset="9776" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="968972_const" type="Const" version="opset1">
			<data element_type="f32" offset="9904" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="969973_const" type="Const" version="opset1">
			<data element_type="f32" offset="9776" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="970974_const" type="Const" version="opset1">
			<data element_type="f32" offset="9904" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="bottleneck1_2/dim_inc/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="bottleneck1_2/dim_inc/conv/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="bottleneck1_2/dim_inc/conv/Dims2209/copy_const343_const" type="Const" version="opset1">
			<data element_type="f32" offset="10032" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="bottleneck1_2/dim_inc/conv" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="947951_const" type="Const" version="opset1">
			<data element_type="f32" offset="10160" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="948952_const" type="Const" version="opset1">
			<data element_type="f32" offset="10164" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="949953_const" type="Const" version="opset1">
			<data element_type="f32" offset="10160" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="950954_const" type="Const" version="opset1">
			<data element_type="f32" offset="10164" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="bottleneck1_2/add/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="bottleneck1_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="bottleneck1_2/fn" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="12371241_const" type="Const" version="opset1">
			<data element_type="f32" offset="10168" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="12381242_const" type="Const" version="opset1">
			<data element_type="f32" offset="10172" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="12391243_const" type="Const" version="opset1">
			<data element_type="f32" offset="10168" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="12401244_const" type="Const" version="opset1">
			<data element_type="f32" offset="10172" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="bottleneck1_3/add/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="125/Output_0/Data__const347_const" type="Const" version="opset1">
			<data element_type="f32" offset="10176" shape="8,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="16671671_const" type="Const" version="opset1">
			<data element_type="f32" offset="11200" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="16681672_const" type="Const" version="opset1">
			<data element_type="f32" offset="11232" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="16691673_const" type="Const" version="opset1">
			<data element_type="f32" offset="11200" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="16701674_const" type="Const" version="opset1">
			<data element_type="f32" offset="11232" shape="8,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="bottleneck1_3/dim_red/conv/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="bottleneck1_3/dim_red/conv/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
